export interface FixedAnswer {
  text: string;
  image: string;
}

export interface FixedQA {
  question: string;
  answers: FixedAnswer[];
}

export const fixedQAData: FixedQA[] = [
  {
    "question": "친구와 함께 하기 좋은 식당을 추천해줘",
    "answers": [
      {
        "text": "친구들과 방문한다면\n'핫쵸(Hotcho)'를 추천해요. 함께 나누어 먹기 좋은 오코노미야키가 시그니처인, 핫한 식당이랍니다!",
        "image": "/QA_Imgs/1-1.png"
      },
      {
        "text": "트랜디한 분위기, 모임을 가지기 좋은\n'캘리포니아피자키친'을 추천드려요. 피자와 스테이크, 리조토 등이 맛있는 곳으로, 여유롭게 대화하며 즐기기 좋아요.",
        "image": "/QA_Imgs/1-2.png"
      }
    ]
  },
  {
    "question": "KPOP 관련 구경거리를 추천해줘",
    "answers": [
      {
        "text": "K-POP 팬이시라면 '케이타운포유\n(Ktown4u)'를 추천드려요. 앨범과 굿즈를 구경 할 수 있는 매장으로, 팝업 스토어 전시까지 즐길 수 있답니다!",
        "image": "/QA_Imgs/2-1.png"
      },
      {
        "text": "K-컬처의 에너지를 느끼고 싶다면\nK-POP 광장을 추천해요. 거대한 전광판에 나오는 아티스트 영상을 감상하며 인증샷을 남기기 좋답니다!",
        "image": "/QA_Imgs/2-2.png"
      }
    ]
  },
  {
    "question": "데이트하기 좋은 곳을 추천해줘",
    "answers": [
      {
        "text": "쾌적하고 즐거운 데이트를 위해\n'메가박스 코엑스'를 추천드려요. 영화를 보고 나와, 근처 식당가와 카페에서 시간을 보내기에도 편한 위치랍니다!",
        "image": "/QA_Imgs/3-1.png"
      },
      {
        "text": "실내 데이트의 정석!\n'코엑스 아쿠아리움'을 추천합니다. 아름다운 수중 터널을 함께 걸으며 로맨틱한 시간을 보낼 수 있을 거예요.",
        "image": "/QA_Imgs/3-2.png"
      }
    ]
  },
  {
    "question": "가족과 함께 놀기 좋은 곳을 추천해줘",
    "answers": [
      {
        "text": "가족과 함께 즐기기 좋은 장소로\n'코엑스 아쿠아리움'을 추천합니다. 테마별 전시관과 신비한 수중 공연이 펼쳐져, 모두에게 특별한 경험이 될 거예요!",
        "image": "/QA_Imgs/4-1.png"
      },
      {
        "text": "가족과 함께 방문한다면\n'피에프창(PF Chang's)'을 추천해요! 퓨전 아시안 식당으로, 나이 상관없이 온 가족이 편안하게 식사할 수 있습니다.",
        "image": "/QA_Imgs/4-2.png"
      }
    ]
  },
  {
    "question": "혼놀하기 좋은 곳을 추천해줘",
    "answers": [
      {
        "text": "혼자만의 시간을 보내고 싶다면\n'메가박스 코엑스'를 추천해요. 돌비 시네마 등 최첨단 시설 속에서 오롯이 영화에만 몰입하기 최적이랍니다!",
        "image": "/QA_Imgs/5-1.png"
      },
      {
        "text": "혼자 조용히 시간을 보내고자 한다면\n'영풍문고'를 추천해요! 책과 다채로운 문구류를 구경하기 좋아 여유로운 혼놀 장소로 안성맞춤이랍니다!",
        "image": "/QA_Imgs/5-2.png"
      }
    ]
  },
  {
    "question": "쇼핑하기 좋은 곳을 찾고 있어",
    "answers": [
      {
        "text": "최신 패션을 접하고 싶다면 스타필드\n코엑스몰의 지하 1층을 방문해보세요. 글로벌 SPA 브랜드부터 힙한 패션까지 다양한 패션 트랜드를 경험할 수 있어요!",
        "image": "/QA_Imgs/6-1.png"
      },
      {
        "text": "소품에 관심있다면 '버터(BUTTER)'나\n'자주(JAJU)'를 방문해 보세요. 시즌마다 변화하는 아이디어 상품들이 가득해 구경하는 재미가 쏠쏠할 거예요!",
        "image": "/QA_Imgs/6-2.png"
      }
    ]
  },
  {
    "question": "조용히 작업할 수 있는 카페를 찾고 있어",
    "answers": [
      {
        "text": "넓고 차분한 분위기의\n'테라로사(TERAROSA)'를 추천합니다! 커피가 맛있기로 유명하고, 비교적 조용한 분위기여서 노트북 작업을 하거나 독서하기에 좋습니다.",
        "image": "/QA_Imgs/7-1.png"
      },
      {
        "text": "세련된 분위기의 '피어커피\n(Peer Coffee)'를 추천드려요. 좌석 배치가 여유롭고 커피 맛이 훌륭해 혼자 방문해 집중하기 좋은 환경입니다.",
        "image": "/QA_Imgs/7-2.png"
      }
    ]
  },
  {
    "question": "부모님과 방문하기 좋은 곳을 알고 싶어",
    "answers": [
      {
        "text": "부모님과 함께 방문한다면\n한식 음식점 '하동관'을 추천해요! 깊은 국물의 한우 곰탕은 자극적이지 않고 담백해, 정갈한 식사를 할 수 있어요.",
        "image": "/QA_Imgs/8-1.png"
      },
      {
        "text": "부모님과 여유를 즐기고 싶다면\n'아라비카(Arabica)'를 추천해요. 별마당 도서관 뷰를 한눈에 담을 수 있고, 라떼 한 잔과 휴식을 만끽하기 좋아요!",
        "image": "/QA_Imgs/8-2.png"
      }
    ]
  },
  {
    "question": "코엑스에서 가장 유명한 곳에 가고싶어",
    "answers": [
      {
        "text": "코엑스의 유명한 장소를 찾으신다면\n'별마당 도서관'은 필수 코스입니다. 독특한 형태를 띄고 있어 사진찍기 좋고 잠시 쉬어가기도 좋은 공간이랍니다!",
        "image": "/QA_Imgs/9-1.png"
      },
      {
        "text": "건물에 들어오기 전 코엑스 입구의\nLED 스크린을 구경하셨나요? 미디어 아트, 광고 등 화려한 영상미를 자랑하며, 필수 인증샷 코스랍니다.",
        "image": "/QA_Imgs/9-2.png"
      }
    ]
  },
  {
    "question": "분위기 있는 트렌디한 음식점을 찾고 있어",
    "answers": [
      {
        "text": "고메스트리트에 위치한 중식당\n'무탄'을 추천드려요! 퓨전레스토랑으로, SNS에서 화제가 된 독특한 메뉴들을 맛볼 수 있습니다.",
        "image": "/QA_Imgs/10-1.png"
      },
      {
        "text": "세련된 유러피안 그릴 요리를 선보이는\n'이비티(ebt)'를 추천드려요. 감각적인 플레이팅과 인테리어 덕분에 트렌디한 미식 경험이 가능하답니다!",
        "image": "/QA_Imgs/10-2.png"
      }
    ]
  }
];

